/**
 * В этом пакете содержится часть справочника, которая отвечает получение, хранение и обработку данных.
 * Для храненния данных используются строки и даты, инкапсулированные в внутренние объекты - базовые элементы справочника.
 * Части справочника, такие как список разделов, товарных групп или товарных позиций представляют из себя массивы базовых элементов справочника.
 * Четыре таких части инкапсулированы в один объект, который и содержит всю имеющуюся в справочнике информацию
 * и предоставляет все необходимые для работы с ней методы.
 * @version 0.4
 * @since 0.4
 * @author Vladimir Tsurkanenko
 */
package ru.tsurkanenko.vladimir.hscodes.database.ver4;
