/**
 * В этом пакете содержится часть справочника, которая отвечает получение, хранение и обработку данных.
 * Для храненния данных используются строки и даты, инкапсулированные в внутренние объекты - базовые элементы справочника.
 * Части справочника, такие как список разделов, товарных групп или товарных позиций представляют из себя массивы базовых элементов справочника.
 * Четыре таких части инкапсулированы в обин объект, который и содержит всю имеющуюся в справочнике информацию
 * и предоставляет все необходимые для работы с ней методы.
 */
package ru.tsurkanenko.vladimir.hscodes.database.ver3;
